#!/usr/bin/env python3
'''
x = 2112
i = 0
ans = 0
while i < x:
    ans += sum(map(lambda x: x ** 2, [i // 10, i % 13]))
    i += 7
print(ans)  #4462910

x1 = 123424242143132324326922342152 + 213732174232497412039472189472409
print(x1)

print('Питон', 'позволяет', 'автоматизировать', 'рутинные', 'задачи', 'на', 'решение', 'которых', 'вручную',
      'уходят', 'лучшие', 'годы', 'жизни', sep=', ммм, ')

print( 12321482349287421983798237241 * 123721947294287497234957,
       2793042981421894210947210947 // 209734721987420234281947,
       sep='\n')

I = 102341132412344234
R = 9876387639476324727
print(I*R)

print(38746298762973632324233242//60)

print(38746298762973632324233242%60)

print(-82372642987463918269721 %60)

print('A'*1000)

print(str(213169**123)*10)

print(int(str(213169**123)*10)**2)

x1 = int(input())
x2 = int(input())
x = x1*100 +x2
y = x*2
print(str(y//100),str(y%100))

x = x1*60 +x2
print(str((x//60)%24),str(x%60))

x1 = int(input())
x2 = int(input())
x3 = int(input())
s = (x1 * x2) // x3
if (x1 * x2) % x3:
    s += 1
print(s)
'''
x1 = int(input())
x2 = int(input())
x3 = int(input())
x4 = int(input())
s = ((x1 + x2)* 2 * x3) // x4
if ((x1 + x2) * 2 * x3) % x4:
    s += 1
print(s)

